{"pageProps":{"postData":{"slug":["2022","underhanded"],"contentRaw":"\nI just heard about the [2022 Underhanded Solidity Contest](https://underhanded.soliditylang.org/)\nand submissions are due in a day.\n\n## About the Contest\n\nFrom the website: \"The goal of the Underhanded Soldity Contest is to write seemingly innocent and straightforward-looking Solidity code which actually contains malicious behavior or backdoors.\"\n\nI have recently started getting into Solidity CTF challenges and wanted to give it a go.\nDesigning smart-contract challenges sounds like a fun task.\nThere have been times while coding a contract where I had to shudder,\nbecause I realized a terrible mistake in my code.\nI thought some of these could end up being interesting CTF Challenges.\n\nThis years theme for the challenge is about decentralized exchanges. Any kind, orderbook or AMM.\nAnd, \"simplicity is key\" is emphasized.\n\nI came up with two challenges that I [uploaded to Github](https://github.com/willisk/SmartContract-Challenges) if you want to give them a try!\n\nI was first going to go with submitting the bitmap challenge [\"ExclusiveExchange.sol\"](https://github.com/willisk/SmartContract-Challenges/blob/master/contracts/ExclusiveExchange.sol),\nbecause it came across as unique (albeit also a bit of a niche setting).\nAlthough, after stripping away any unnecessary, distracting fluff from the contract,\nthe vulnerability seemed too obvious.\nAnd, especially after hearing that @samczsun from paradigm will be on the board\n(famous for [his pinball machine](https://samczsun.com/hiding-in-plain-sight/) - probably one of the hardest challenges regarding bitmaps),\nI decided to come up with another one.\n\nSo, I wrote the second challenge [\"NFTOrderBook.sol\"](https://github.com/willisk/SmartContract-Challenges/blob/master/contracts/NFTOrderBook.sol).\nThe setup for this one is a bit more realistic and the bug is more common, although a bit simple.\nI still have not seen any other CTF challenge revolve around this vulnerability/error,\nso it could be a good fit.\n\nI might have a small write-up, after I have some people test them out\nand give me feedback.\n","title":"Underhanded Solidity Contest","date":"15 Mar 2022","excerpt":"The 2022 Underhanded Solidity Contest submissions are coming up."}},"__N_SSG":true}