{"pageProps":{"postData":{"slug":["2022","underhanded"],"contentRaw":"\nSubmissions for the [2022 Underhanded Solidity Contest](https://underhanded.soliditylang.org/)\nare due in one day.\n\n## About the Contest\n\nFrom the website: \"The goal of the Underhanded Soldity Contest is to write seemingly innocent and straightforward-looking Solidity code which actually contains malicious behavior or backdoors.\"\n\nI have only recently started getting into Solidity CTF challenges, but wanted to give it a go.\nThere have been a few moments while coding a contract where I had to shudder, because I realized\na terrible mistake in my code.\nI thought some of these could be used to come up with interesting CTF Challenges.\n\nThis years theme for the challenge is about decentralized exchanges. Any kind, orderbook or AMM.\nAlthough, \"simplicity is key\" is emphasized.\n\nI came up with two challenges that I [uploaded to Github](https://github.com/willisk/SmartContract-Challenges) if you want to give them a try!\n\nI was first going to go with submitting the bitmap challenge [\"ExclusiveExchange.sol\"](https://github.com/willisk/SmartContract-Challenges/blob/master/contracts/ExclusiveExchange.sol),\nbecause I it came across as a unique problem (albeit also a bit of a niche setting).\nThe inspiration came from noticing a bug/vulnerability in a contract I was working on that had to do with bitmaps.\nAlthough, after dumbing it down and keeping it as simple as possible, I decided the vulnerability\nwould be way to obvious.\nEspecially, after hearing that @samczsun from paradigm will be on the board\n(in my eyes famous for [his complex pinball machine](https://samczsun.com/hiding-in-plain-sight/)).\n\nThat's when I wrote the second challenge [\"NFTOrderBook.sol\"](https://github.com/willisk/SmartContract-Challenges/blob/master/contracts/NFTOrderBook.sol).\nThis one I found more appropriate for the submission, because the setup is more realistic\nand the bug is more common. Although I still have not seen any other CTF challenges actually\nrevolve around this vulnerability/error.\n\nI might have a small write-up on the challenges I made, after I have some people test them out\nand give me feedback.\n","title":"Underhanded Solidity Contest","date":"15 Mar 2022","excerpt":"My last bug report on an exploit that allowed unlimited minting had me thinking about counter-measures to an attack."}},"__N_SSG":true}