{"pageProps":{"postData":{"slug":["knowledge","consensus"],"contentRaw":"\n# Why do we need consensus?\n\nReaching consensus is important to be able to resist sybil attacks and to agree on the current valid state of the blockchain. More formally, consensus is reached when 66% of the nodes agree on the network state.\n\n# What is a sybil attack?\n\nIt's a form of attack on a network through an entity that creates multiple fake identities.\nSybil resistance is gained if a network is able to resist such an attack.\nPoW's resistance comes through the expenditure of a limited resource: compute power.\nPoS's resistance comes through the expenditure of a limited resource: capital.\nPoHumanity also conceivable.\n\n\n# What are some consensus mechanisms?\n- Proof of Stake\n- Proof of Work\n- Proof of Authority\n- Proof of History\n\n# What is Proof of Stake?\n\nPoS is a consensus mechanism by which validators are selected by their capital\n\n- less energy consumption\n- lower barrier of entry\n- reduced centralization risk (ASICs, specialized miners)\n- less ETH issuance required\n- higher security due to high deterrents (slashing)\n\n# How are validators chosen?\n\nPoS on ethereum requires locking 32 ETH in deposit contract and run execution client, consensus client, and a validator.\nValidators receive blocks from peers.\n\n- PoW has approximate timings, PoS fixed slots (12 second slots; 1 epoch = 32 slots)\n\n# What is byzantine fault tolerance?\n\n# What is proof of work mining?\n\n- cryptographic proof: hard to create, easy to verify\n- requires a lot of computational power in the form of consensus mechanism\n- cryptographic puzzles are ran to determine the next block proposer/validator\n- in proof of work chain finality is probabilistic\n- sybil defense mechanism\n\n\n# What is a fork?\n\nA fork is when a blockchain is split into multiple divergent blockchain paths. \nThe result is two or more current blockchain heads.\nAnd more generally, when parties are not in agreement on the true state of the network.\n\nThis can happen due to:\n- consensus failure (failure in validator client implementation)\n- dishonest behavior\n- network latency\n\nalso intentional:\n- social agreement (DAO hack)\n- upgrades\n\n\nPoS fork-choice rule LMD GHOST.\n\n**Hard fork:**\n- new blocks validated under old software would be deemed invalid\n\n**Soft fork:**\n- old nodes might accept blocks that appear invalid under the new rule\n\n# How are forks resolved (fork choice rule)?\n\nThrough consensus mechanisms. I.e. under PoW the longest chain is selected. In PoS the 'heaviest' chain is selected (most attestations weighted by stake).\nCan also be resolved through **social consensus** or **software upgrades**.\n\n\n# What is block finality?\n\nA transaction can reach finality once it cannot change without a significant economic burden.\n\nIn **PoW finality is probabilistic - after a certain amount of blocks it becomes very unlikely to be undone -, in PoS it is through Casper FFG?\n\nIn PoS finality is managed using checkpoint blocks (first block in each epoch = 32 blocks).\nValidity of checkpoint blocks are voted on in pairs.\nEarlier block becomes \"finalized\", more recent block becomes \"justified\".\n\n- requires 2/3 of total staked ETH.\n- attacker could prevent this with 1/3, but *inactivity leak* burns away eth of inactive validator\n- no reward if validators fail to respond, minor penalty for not submitting votes\n- slashing for dishonest behavior (signing two blocks in one slot): 0.5 eth on day 1, correlation pen. on day 18, ejection on day 36\n\n\n# What is a block reversion?\n\n# What is a 51% attack? What can happen?\n\nA 51% attack is when miners collude that control over 50% of the network's mining hash rate.\nThey are then able to:\n- Prevent other miners from completing blocks (censor)\n- Reverse transactions (reorgs)\n- Double spends (affects exchanges)\n\n51% attacks can also occur when a bug in the software exists, allowing a malicious user to produce faster blocks (ethereum classic, or bug in Verge XVG blockchain april 2018).\n\nGenerally **requires a lot of resources**: electricity, mining servers, storage space, legal risk.\n\n# How can this happen under PoS?\n","title":"Consensus Mechanisms","date":"Invalid Date"}},"__N_SSG":true}