{"pageProps":{"postData":{"slug":["knowledge","motivation"],"contentRaw":"\n# What excites you about Ethereum?\n\nOpen, permissionless and automated protocols are exciting.\n\n# What protocol do you find most interesting?\n\nUniswap AMM..\nPolymarket prediction markets. Uses ERC1155 conditional tokens. Able to deposit collateral to mint all possible outcomes (A, B, C, ...). These can be traded on the open markets. Once the question result is in, only the outcome can be exchanged for collateral.\n\n# What are some of the projects you've worked on?\n**CRFTD:** No-code platform for NFT projects. Allows for token creation, cross-chain staking, marketplace.\n**GMC:** NFT project on ethereum, with FxERC721M cross-chain staking. On-chain game on Polygon. Contains many components (64 transactions setup). Developed UpgradeScripts to automate and keep track of deployments. Test-setup should be as close to possible as deployment. Same setup for testing, deployment, interactions & integration tests.\n\n# Where do you see the space of security research evolving towards? What will blockchain security look like 5-10 years from now?\n\nLots of increased automation. Automatic vulnerability detection through static analysis, automatic contract type detection, contract invariant monitoring (FORTA), AI. Also automatic defenses.\n\n# What do you think are some of the most important open research questions related to blockchain security?\n\n# What is a research question that you have thought of yourself? How would you approach it?\n\n# What is your motivation for doing security research?\n\nHacking has always excited me. Felt like too far of a stretch & jump from my current field. More accessible, open playing field once I got into Ethereum. One and the same language.\nLove sifting through code, understanding new concepts. Also understanding the way another person thinks. I often rewrite code myself multiple times when I think there is a better/cleaner solution. I love discussing and optimizing code (also for simplicity and auditability). Smart contracts require high standards, diligent testing and full immersion into code.","title":"Motivation","date":"Invalid Date"}},"__N_SSG":true}