{"pageProps":{"postData":{"slug":["unpublished","shared-sequencing"],"contentRaw":"\n- [What is shared sequencing?](#what-is-shared-sequencing)\n  - [What is a rollup?](#what-is-a-rollup)\n  - [What is the sequencer's role?](#what-is-the-sequencers-role)\n  - [Why should we care about decentralizing the sequencer?](#why-should-we-care-about-decentralizing-the-sequencer)\n- [Overview of the shared sequencer stack](#overview-of-the-shared-sequencer-stack)\n  - [The sequencing layer](#the-sequencing-layer)\n    - [A rollup agnostic super block](#a-rollup-agnostic-super-block)\n    - [Lazy sequencing](#lazy-sequencing)\n    - [Atomic composability](#atomic-composability)\n  - [Consensus algorithm](#consensus-algorithm)\n  - [Based rollups](#based-rollups)\n  - [Proposer builder separation](#proposer-builder-separation)\n  - [Data Availability](#data-availability)\n  - [Encryption](#encryption)\n- [Current state of shared sequencing](#current-state-of-shared-sequencing)\n  - [Overview of different platforms](#overview-of-different-platforms)\n  - [Rollup alignment](#rollup-alignment)\n- [Research questions and outlooks](#research-questions-and-outlooks)\n- [Conclusion](#conclusion)\n\n# What is shared sequencing?\n\n## What is a rollup?\n\nA rollup chain—a layer 2 blockchain—is a blockchain that builds on top of another host blockchain—the layer 1 blockchain. It can be characterized by a few key points:\n\n1. Builds on top of L1.\n2. Inherits L1 security: Objective finality (fraud proofs or validity proofs).\n3. Liveness guarantees from L1: L1 chain is unlikely to go offline.\n4. Data availability guaranteed through L1: Transactions are posted as calldata or blobs.\n5. Cheaper due to transaction compression, off-chain execution, and small state commits.\n\nThe L2 chain inherits the L1 chain's finality guarantees. Once a fraud proof window has passed or a validity proof has been included in a finalized L1 block, it is automatically finalized as seen by the L2. A double spending attack would require an L1 chain block reorganization.\n\nThe L2 chain also benefits from the host chain's decentralized validator set and economic security in terms of liveness. The L1 chain is unlikely to go offline and censor transactions. In principle, the rollup should be able to continue advancing its state and produce blocks as long as the L1 chain is online.\n\nThe layer 2 blockchain will likely run a layer 1 node in parallel. Since all the relevant layer 2 transaction data is available when syncing the layer 1 node—either through L1 calldata or EIP-4844 data blobs—the state of the layer 2 blockchain can be recomputed entirely by only relying on data from the host blockchain.\n\nRollups benefit from cheaper transaction costs. This is because layer 2 transaction data can be compressed and decompressed off-chain. Also, costly updates to the state database and execution do not happen on the more expensive layer 1 chain. Only every N block/state commits are required to be stored in the host chain's rollup contract.\n\nA big challenge that most rollups face today is meeting the demand for faster finality than L1 for improved user experience. This forces the rollup to use a centralized and trusted sequencer.\n\n## What is the sequencer's role?\n\nWhen a user sends a layer 2 transaction, it is first picked up by the sequencer. The sequencer's job is to commit to a transaction ordering such that the new rollup state can be determined reliably. Once the ordering is set, all other node operators can compute the rollup's new state by applying the deterministic state transition function iteratively producing layer 2 blocks.\n\n![Arbitrum's transaction lifecycle](../../public/data/blog/2023/arbitrum/arbitrum-nitro-whitepaper-transaction.png)\n\n1.  Sequencer receives multiple user transactions\n2.  Sequencer orders these\n3.  Sequencer sends out an ordering promise (feed)\n4.  Batched and compressed transactions are committed to L1 chain\n5.  The L2 transactions are executed off-chain\n6.  The new L2 blocks are confirmed to the L1 chain\n\nThe new state can be computed by running the Nitro Geth fork which also fetches the transaction data from the layer 1 blockchain. The transaction data itself does not necessarily need to be committed to persistent state. It is often only included as transaction calldata to the sequencers ordering commitment such that layer 1 operators are able to fetch and process the transactions. An alternative that has been made possible recently through EIP-4844 is to use data blobs for the transaction data availability.\n\nWhile fraud proving an invalid block is less permissioned, the sequencer is arguably the most centralized component of today's layer 2 rollups.\n\nThe reason that the shared sequencer often is a centralized component today is that it is quite an engineering feat to implement. All other rollup components work deterministic and are clear to compute, whereas decentralizing the sequencer requires an additional consensus algorithm or auctioning mechanism. Along with this come a plethora of fairness, economic security and decentralized coordination questions and concerns. Similar to the advantages of being able to produce the block on a layer 1 blockchain, being able to determine the transaction ordering comes with the ability of extracting user value and transaction censorship.\n\n## Why should we care about decentralizing the sequencer?\n\nBuilding a shared sequencer that is fast, incorruptible and decentralized might seem like a **big engineering undertaking** that probably will come with a slightly **worse user experience**, **additional security risks** and a **loss in autonomy and fees for rollups**. _Why would we even want and care for decentralizing the sequencer?_\n\nAs with many blockchain components, a **central point of failure** is not desirable. The goal is to build censorship resistant and resilient infrastructure that cannot be corrupted in the moment when it counts. Having a centralized component inevitably means that a party with enough influence might be able to corrupt the component if the desire is high enough. This can in the form of a government decree that aims to censor certain users and protocols or by any actor with a shared interest. **Censorship and inclusion delays** can even come from the rollup's sequencer themselves. Further, an accidental server crash or data breach can occur leading to protocol **liveness** issues. Or worse, a sequencer might not fulfill its promise to include pre-committed transactions opening up the possibility of **double spend attacks**.\n\nCurrently, most centralized sequencers handle incoming user transactions via a private transaction mem-pool on a first come first serve basis. Having complete control over the sequencer also means that there is a monopoly on inclusion and ordering pricing. In principle, the sequencer stands to benefit from performing MEV (front and back-running, delaying or including its own transactions) or from selling the block building rights.\n\nIn summary, the following reasons highlight why we would want to move away from a centralized sequencer:\n\n- Censorship resistance\n- Robustness: Liveness\n- Trust requirements\n- Block building rights for all\n\nIf a sequencer is decentralized, there is no need for it to only server one rollup. A decentralized sequencing protocol might as well act as a shared sequencing abstraction layer that multiple rollups can plug into. This opens up the door to the possibility of atomic composability between rollups. Outsourcing the sequencer role for rollups to a shared sequencer service can come with the added benefits of:\n\n- Decentralized sequencing\n- Outsourced development cost\n- Higher code security guarantees\n- Atomic composability\n- Batch posting cost amortization\n\nFurther, some shared sequencer services want to provide even more value, such as:\n\n- Pre-execution privacy (encrypted mem-pool)\n- Subsidized transactions & MEV revenue share\n- Block builder auctions\n- Reduced costs: Integration with Data Availability layer\n- Guaranteed pre-commits\n- Restaking ability\n\nIt is unclear whether most rollups will be interested in sharing a sequencer. As block building rights can be auctioned off at high prices and can lead to bad user experience, most bigger rollup chains will likely employ their own solutions and either capture and redistribute or use a fair ordering mechanism. Decentralizing the sequencer is currently part of Arbitrum's and Optimism's roadmap. Smaller blockchains with less engineering manpower will be happy to plug in a modular component that offers a decentralized sequencing solution with some added benefit.\n\n# Overview of the shared sequencer stack\n\n## The sequencing layer\n\nWhen talking about integrating a shared/decentralized sequencer into a rollup protocol the idea is to abstract and outsource the entire sequencing process into a \"sequencing layer\".\n\n![Shared sequencing layer](shared-sequencing-layer.svg)\n\n1.  Multiple transactions from multiple rollups are processed by the sequencing layer\n2.  The sequencing layer produces a \"super block\" by some mechanism\n3.  The individual transactions are processed by the respective rollup chains\n\nA _shared sequencer_ can be shared by multiple rollups. Once the infrastructure for a decentralized sequencer has been built it can, at least in theory, easily be plugged into other rollups as well.\n\n### A rollup agnostic super block\n\nA shared sequencer can produce a block containing transactions for multiple rollups. This is sometimes referred to as a \"super block\". A super block is technically not a block, but more of a list of transactions, since the transactions are not actually executed in the sequencing layer. In order to abstract the sequencing layer, it has to be decoupled from the execution layer. If a shared sequencer should be able to handle the ordering of transactions from any kind of rollup, then it inevitably must be agnostic to the rollup's executing virtual machine.\n\n### Lazy sequencing\n\nThis also has the added benefit that the sequencing layer now can solely focus on one thing—the sequencing. Any sequencing mechanism that is dependent on the execution machine will suffer from potential Denial-of-service attack vectors. This is because the sequencers now must also be able to execute and produce blocks from various different rollups requiring running multiple different blockchain node programs in parallel.\n\n### Atomic composability\n\nA desirable property for super blocks is **atomic intra-rollup composability**. For example, a bridging transaction typically involves burning tokens on the source chain and minting them on the target chain. If a shared sequencer has the ability to atomically include transactions from various rollups, then it is also possible to include both a burn and a mint transaction atomically greatly enhancing the bridging experience.\n\nUnfortunately, atomic inclusion does not guarantee atomic execution. This is because of the desired requirement of decoupling the sequencing from the execution layer. A shared sequencer can guarantee the inclusion of both transactions in their respective chains, however it cannot guarantee that these transactions will not fail.\n\nPreviously valid transactions can revert upon actual execution due to state changes in the blockchain. A user might have transferred the tokens out of their wallet or simply increased their account's nonce in the meantime. It would be a serious issue if the burn transaction failed, but the mint transaction succeeded.\n\n## Consensus algorithm\n\nDecentralizing the sequencer comes with the added challenge of reaching consensus in an adversarial setting. A set of distributed nodes needs to be able to agree on the next set of transactions in the presence of faulty and malicious nodes. This is called byzantine fault tolerance (BFT) and remains a core problem to solve for layer one blockchains.\n\nThe previous transaction lifecycle diagram makes it clear that our newly computed state is dependent on the ordered set of transaction inputs. Given these inputs, the rollup's state transition function will deterministically produce L2 blocks and other nodes will always arrive at the same L2 state root. This is also largely much how L1 blockchains work today. Given a list of ordered transactions, a L1 block is executed deterministically to arrive at a new state root.\n\nThe only non-deterministic part of a blockchain's state machine is the list of transactions that make up a block. The challenge lies in coordinating who gets to elect the new block.\n\n## Based rollups\n\nWith all the additional complications that decentralizing the sequencer brings forth, is there no simpler way to reach consensus? There is.. A _based rollup_ simply uses the host chain's consensus mechanism to determine the rollup chain's transaction ordering. This can be achieved by allowing anyone to propose and submit a new block in the rollup's sequencing smart contract. This way, once the host chain's blocks are finalized, a transaction ordering will be determined.\n\n_Why would we still want to consider alternative solutions to based rollups?_\n\nThe transaction confirmation speed of based rollups will always be limited to the host chain's confirmation speed. A centralized sequencer can give out instant pre-commitment confirmations of the transaction ordering, because it is the only leader and it knows it can fulfill the promise. Although this is not implemented by most rollups with a centralized sequencer, these pre-commitments could be accompanied by a verifiable signature and a slashing mechanism in the case that the sequencer breaks its promise. This makes for a great user experience as the confirmation speed is increased at the expense of decentralization.\n\n_Why should we even build on top of an L1 at all?_\n\nUsing a host chain as a base settlement layer can still provide benefits. By leveraging the host chain's execution layer, a rollup's entire fraud proving system can be secured or validity proofs can be verified immediately. Further mechanisms such as slashing can be integrated and benefit from the embedded environment's economic security. Data availability and liveness are still strong arguments for building on top of a well-established layer one chain, although this might change if another consensus mechanism is implemented and data availability services are integrated.\n\n## Proposer builder separation\n\nAs the challenges of decentralizing the sequencer are similar to those of the\n_Why should we care about fair builder markets?_\n\nWhen aiming to decentralize the sequencer, we face similar consensus problems as with a layer one blockchain. This is unless we use the host blockchain itself to determine a transaction ordering\n\n## Data Availability\n\n## Encryption\n\n# Current state of shared sequencing\n\n## Overview of different platforms\n\n## Rollup alignment\n\n# Research questions and outlooks\n\n# Conclusion\n","title":"Shared Sequencing","date":"Apr 24, 2024"}},"__N_SSG":true}